#### Removing columns from the data frame

In [27]:
import pandas as pd

In [28]:
ufo = pd.read_csv(r"http://bit.ly/uforeports")

In [29]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [30]:
ufo.shape

(18241, 5)

In [31]:
ufo.drop(columns='Colors Reported', inplace=True)

In [32]:
new_ufo = pd.read_csv(r"http://bit.ly/uforeports")

In [33]:
new_ufo.drop("Colors Reported", axis=1)

                       City Shape Reported State              Time
0                    Ithaca       TRIANGLE    NY    6/1/1930 22:00
1               Willingboro          OTHER    NJ   6/30/1930 20:00
2                   Holyoke           OVAL    CO   2/15/1931 14:00
3                   Abilene           DISK    KS    6/1/1931 13:00
4      New York Worlds Fair          LIGHT    NY   4/18/1933 19:00
...                     ...            ...   ...               ...
18236            Grant Park       TRIANGLE    IL  12/31/2000 23:00
18237           Spirit Lake           DISK    IA  12/31/2000 23:00
18238           Eagle River            NaN    WI  12/31/2000 23:45
18239           Eagle River          LIGHT    WI  12/31/2000 23:45
18240                  Ybor           OVAL    FL  12/31/2000 23:59

[18241 rows x 4 columns]

In [34]:
new_ufo.shape[0] - new_ufo['Colors Reported'].isnull().sum()

2882

In [35]:
ufo.drop(['City', 'State'], inplace=True, axis=1)

In [36]:
ufo.head()

  Shape Reported             Time
0       TRIANGLE   6/1/1930 22:00
1          OTHER  6/30/1930 20:00
2           OVAL  2/15/1931 14:00
3           DISK   6/1/1931 13:00
4          LIGHT  4/18/1933 19:00

In [37]:
ufo['Date'] = ufo['Time'].apply(lambda x : x.split()[0])

In [38]:
ufo

      Shape Reported              Time        Date
0           TRIANGLE    6/1/1930 22:00    6/1/1930
1              OTHER   6/30/1930 20:00   6/30/1930
2               OVAL   2/15/1931 14:00   2/15/1931
3               DISK    6/1/1931 13:00    6/1/1931
4              LIGHT   4/18/1933 19:00   4/18/1933
...              ...               ...         ...
18236       TRIANGLE  12/31/2000 23:00  12/31/2000
18237           DISK  12/31/2000 23:00  12/31/2000
18238            NaN  12/31/2000 23:45  12/31/2000
18239          LIGHT  12/31/2000 23:45  12/31/2000
18240           OVAL  12/31/2000 23:59  12/31/2000

[18241 rows x 3 columns]

In [39]:
ufo['Date'] = pd.to_datetime(ufo['Date'])

In [40]:
ufo['Time'] = ufo['Time'].apply(lambda x : x.split()[1])

In [42]:
ufo.head()

  Shape Reported   Time       Date
0       TRIANGLE  22:00 1930-06-01
1          OTHER  20:00 1930-06-30
2           OVAL  14:00 1931-02-15
3           DISK  13:00 1931-06-01
4          LIGHT  19:00 1933-04-18

In [54]:
ufo['Time'] = ufo['Time'].dt.strftime("%H:%M")

In [55]:
ufo.head()

  Shape Reported   Time       Date
0       TRIANGLE  22:00 1930-06-01
1          OTHER  20:00 1930-06-30
2           OVAL  14:00 1931-02-15
3           DISK  13:00 1931-06-01
4          LIGHT  19:00 1933-04-18

In [56]:
ufo.head()

  Shape Reported   Time       Date
0       TRIANGLE  22:00 1930-06-01
1          OTHER  20:00 1930-06-30
2           OVAL  14:00 1931-02-15
3           DISK  13:00 1931-06-01
4          LIGHT  19:00 1933-04-18

In [67]:
ufo['Date'].dt.year.max()

2000

In [69]:
ufo.drop(labels=[0, 1], axis=0, inplace=True)

In [76]:
ufo = ufo.reset_index()

In [78]:
ufo.drop(columns='index', inplace=True)

In [79]:
ufo.head()

  Shape Reported   Time       Date
0           OVAL  14:00 1931-02-15
1           DISK  13:00 1931-06-01
2          LIGHT  19:00 1933-04-18
3           DISK  15:30 1934-09-15
4         CIRCLE  00:00 1935-06-15